{
  "format": "layers-model",
  "generatedBy": "keras v3.9.2",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.9.2",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Functional",
      "config": {
        "name": "functional_1",
        "trainable": true,
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 8, 64],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_layer_2"
            },
            "name": "input_layer_2",
            "inbound_nodes": []
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_3",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "filters": 128,
              "kernel_size": [3],
              "strides": [1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv1d_3",
            "inbound_nodes": [[["input_layer_2", 0, 0]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            },
            "name": "batch_normalization_1",
            "inbound_nodes": [[["conv1d_3", 0, 0]]]
          },
          {
            "class_name": "MaxPooling1D",
            "config": {
              "name": "max_pooling1d_2",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "pool_size": [2],
              "padding": "valid",
              "strides": [2],
              "data_format": "channels_last"
            },
            "name": "max_pooling1d_2",
            "inbound_nodes": [[["batch_normalization_1", 0, 0]]]
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_4",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "filters": 64,
              "kernel_size": [3],
              "strides": [1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv1d_4",
            "inbound_nodes": [[["max_pooling1d_2", 0, 0]]]
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_5",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "filters": 32,
              "kernel_size": [3],
              "strides": [1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv1d_5",
            "inbound_nodes": [[["conv1d_4", 0, 0]]]
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "data_format": "channels_last"
            },
            "name": "flatten",
            "inbound_nodes": [[["conv1d_5", 0, 0]]]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "units": 128,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_2",
            "inbound_nodes": [[["flatten", 0, 0]]]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "rate": 0.3,
              "seed": null,
              "noise_shape": null
            },
            "name": "dropout_1",
            "inbound_nodes": [[["dense_2", 0, 0]]]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_3",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_3",
            "inbound_nodes": [[["dropout_1", 0, 0]]]
          }
        ],
        "input_layers": [["input_layer_2", 0, 0]],
        "output_layers": [["dense_3", 0, 0]]
      }
    },
    "training_config": {
      "loss": "binary_crossentropy",
      "loss_weights": null,
      "metrics": ["accuracy"],
      "weighted_metrics": null,
      "run_eagerly": false,
      "steps_per_execution": 1,
      "jit_compile": false,
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "adam",
          "learning_rate": 0.0010000000474974513,
          "weight_decay": null,
          "clipnorm": null,
          "global_clipnorm": null,
          "clipvalue": null,
          "use_ema": false,
          "ema_momentum": 0.99,
          "ema_overwrite_frequency": null,
          "loss_scale_factor": null,
          "gradient_accumulation_steps": null,
          "beta_1": 0.9,
          "beta_2": 0.999,
          "epsilon": 1e-7,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "batch_normalization_1/gamma",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/beta",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/moving_mean",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/moving_variance",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "conv1d_3/kernel",
          "shape": [3, 64, 128],
          "dtype": "float32"
        },
        { "name": "conv1d_3/bias", "shape": [128], "dtype": "float32" },
        {
          "name": "conv1d_4/kernel",
          "shape": [3, 128, 64],
          "dtype": "float32"
        },
        { "name": "conv1d_4/bias", "shape": [64], "dtype": "float32" },
        { "name": "conv1d_5/kernel", "shape": [3, 64, 32], "dtype": "float32" },
        { "name": "conv1d_5/bias", "shape": [32], "dtype": "float32" },
        { "name": "dense_2/kernel", "shape": [128, 128], "dtype": "float32" },
        { "name": "dense_2/bias", "shape": [128], "dtype": "float32" },
        { "name": "dense_3/kernel", "shape": [128, 1], "dtype": "float32" },
        { "name": "dense_3/bias", "shape": [1], "dtype": "float32" }
      ]
    }
  ]
}
